zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE31B/startup_MCXE31B.cpp
WEAK void MU0_B_RX_IRQHandler(void)
{
    MU0_B_RX_DriverIRQHandler();
}

WEAK void MU0_B_IRQHandler(void)
{
    MU0_B_DriverIRQHandler();
}

WEAK void MU1_B_TX_IRQHandler(void)
{
    MU1_B_TX_DriverIRQHandler();
}

WEAK void MU1_B_RX_IRQHandler(void)
{
    MU1_B_RX_DriverIRQHandler();
}

WEAK void MU1_B_IRQHandler(void)
{
    MU1_B_DriverIRQHandler();
}

WEAK void Reserved214_IRQHandler(void)
{
    Reserved214_DriverIRQHandler();
}

WEAK void Reserved215_IRQHandler(void)
{
    Reserved215_DriverIRQHandler();
}

WEAK void Reserved216_IRQHandler(void)
{
    Reserved216_DriverIRQHandler();
}

WEAK void Reserved217_IRQHandler(void)
{
    Reserved217_DriverIRQHandler();
}

WEAK void Reserved218_IRQHandler(void)
{
    Reserved218_DriverIRQHandler();
}

WEAK void Reserved219_IRQHandler(void)
{
    Reserved219_DriverIRQHandler();
}

WEAK void Reserved220_IRQHandler(void)
{
    Reserved220_DriverIRQHandler();
}

WEAK void Reserved221_IRQHandler(void)
{
    Reserved221_DriverIRQHandler();
}

WEAK void Reserved222_IRQHandler(void)
{
    Reserved222_DriverIRQHandler();
}

WEAK void Reserved223_IRQHandler(void)
{
    Reserved223_DriverIRQHandler();
}

WEAK void Reserved224_IRQHandler(void)
{
    Reserved224_DriverIRQHandler();
}

WEAK void Reserved225_IRQHandler(void)
{
    Reserved225_DriverIRQHandler();
}

WEAK void Reserved226_IRQHandler(void)
{
    Reserved226_DriverIRQHandler();
}

WEAK void Reserved227_IRQHandler(void)
{
    Reserved227_DriverIRQHandler();
}

WEAK void PLL_LOL_IRQHandler(void)
{
    PLL_LOL_DriverIRQHandler();
}

WEAK void CORE_CLK_FAIL_IRQHandler(void)
{
    CORE_CLK_FAIL_DriverIRQHandler();
}

WEAK void Reserved230_IRQHandler(void)
{
    Reserved230_DriverIRQHandler();
}

WEAK void AIPS_PLAT_CLK_FAIL_IRQHandler(void)
{
    AIPS_PLAT_CLK_FAIL_DriverIRQHandler();
}

WEAK void Reserved232_IRQHandler(void)
{
    Reserved232_DriverIRQHandler();
}

WEAK void HSE_B_CLK_FAIL_IRQHandler(void)
{
    HSE_B_CLK_FAIL_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif
#endif // (DEBUG)
